app/controllers/messages_controller.rb

INSERT INTO "messages" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "test"], ["description", "test"], ["created_at", "2015-03-29 17:02:39.988483"], ["updated_at", "2015-03-29 17:02:39.988483"]]
---
  def create
    @message = Message.new(message_params)

    respond_to do |format|
      if @message.save

UPDATE "messages" SET "description" = ?, "updated_at" = ? WHERE "messages"."id" = ?  [["description", "test~"], ["updated_at", "2015-03-29 17:04:28.920552"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @message.update(message_params)